app/views/posts/index.html.erb

    <h3>Post: <%= post.content %></h3>
    <ol><% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 2]]