app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
  def index
    @posts = current_user.posts.all

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
  def show
    @comment = Post.find(params[:id]).comments.build

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "dsadas"], ["created_at", "2014-10-01 10:09:23.079598"], ["updated_at", "2014-10-01 10:09:23.079598"], ["user_id", 3]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 5], ["id", 14]]
---
    def set_post
      @post = current_user.posts.find(params[:id])